Ran Plan for dir: `1-org/envs/shared` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # google_access_context_manager_access_policy.access_policy[0] will be created
+ resource "google_access_context_manager_access_policy" "access_policy" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + parent      = "organizations/172403920164"
      + title       = "default policy"
      + update_time = (known after apply)
    }

  # google_bigquery_dataset.billing_dataset will be created
+ resource "google_bigquery_dataset" "billing_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "billing_data"
      + delete_contents_on_destroy = false
      + etag                       = (known after apply)
      + friendly_name              = "GCP Billing Data"
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-southeast1"
      + project                    = (known after apply)
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # google_folder.common will be created
+ resource "google_folder" "common" {
      + create_time     = (known after apply)
      + display_name    = "fldr-common"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/172403920164"
    }

  # google_organization_iam_audit_config.org_config[0] will be created
+ resource "google_organization_iam_audit_config" "org_config" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + org_id  = "172403920164"
      + service = "allServices"

      + audit_log_config {
          + exempted_members = []
          + log_type         = "ADMIN_READ"
        }
      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_READ"
        }
      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_WRITE"
        }
    }

  # google_organization_iam_member.billing_viewer will be created
+ resource "google_organization_iam_member" "billing_viewer" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:billing-admins@menubase.io"
      + org_id = "172403920164"
      + role   = "roles/billing.viewer"
    }

  # google_project_iam_member.audit_log_bq_data_viewer will be created
+ resource "google_project_iam_member" "audit_log_bq_data_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:log-admins@menubase.io"
      + project = (known after apply)
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.audit_log_bq_user will be created
+ resource "google_project_iam_member" "audit_log_bq_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:log-admins@menubase.io"
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.billing_bq_user will be created
+ resource "google_project_iam_member" "billing_bq_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:billing-admins@menubase.io"
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.billing_bq_viewer will be created
+ resource "google_project_iam_member" "billing_bq_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:billing-admins@menubase.io"
      + project = (known after apply)
      + role    = "roles/bigquery.dataViewer"
    }

  # google_pubsub_subscription.scc_notification_subscription will be created
+ resource "google_pubsub_subscription" "scc_notification_subscription" {
      + ack_deadline_seconds       = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "sub-scc-notification"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + topic                      = "top-scc-notification"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # google_pubsub_topic.scc_notification_topic will be created
+ resource "google_pubsub_topic" "scc_notification_topic" {
      + id      = (known after apply)
      + name    = "top-scc-notification"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

  # random_string.suffix will be created
+ resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.bigquery_destination.google_bigquery_dataset.dataset will be created
+ resource "google_bigquery_dataset" "dataset" {
      + creation_time               = (known after apply)
      + dataset_id                  = "audit_logs"
      + default_table_expiration_ms = 2592000000
      + delete_contents_on_destroy  = false
      + description                 = "Log export dataset"
      + etag                        = (known after apply)
      + id                          = (known after apply)
      + last_modified_time          = (known after apply)
      + location                    = "US"
      + project                     = (known after apply)
      + self_link                   = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.bigquery_destination.google_project_iam_member.bigquery_sink_member will be created
+ resource "google_project_iam_member" "bigquery_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/bigquery.dataEditor"
    }

  # module.bigquery_destination.google_project_service.enable_destination_api will be created
+ resource "google_project_service" "enable_destination_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "bigquery.googleapis.com"
    }

  # module.log_export_to_biqquery.google_logging_organization_sink.sink[0] will be created
+ resource "google_logging_organization_sink" "sink" {
      + destination      = (known after apply)
      + filter           = "    logName: /logs/cloudaudit.googleapis.com%2Factivity OR\n    logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR\n    logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR\n    logName: /logs/compute.googleapis.com%2Fvpc_flows OR\n    logName: /logs/compute.googleapis.com%2Ffirewall OR\n    logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency\n"
      + id               = (known after apply)
      + include_children = true
      + name             = "sk-c-logging-bq"
      + org_id           = "172403920164"
      + writer_identity  = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.log_export_to_pubsub.google_logging_organization_sink.sink[0] will be created
+ resource "google_logging_organization_sink" "sink" {
      + destination      = (known after apply)
      + filter           = "    logName: /logs/cloudaudit.googleapis.com%2Factivity OR\n    logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR\n    logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR\n    logName: /logs/compute.googleapis.com%2Fvpc_flows OR\n    logName: /logs/compute.googleapis.com%2Ffirewall OR\n    logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency\n"
      + id               = (known after apply)
      + include_children = true
      + name             = "sk-c-logging-pub"
      + org_id           = "172403920164"
      + writer_identity  = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.log_export_to_storage.google_logging_organization_sink.sink[0] will be created
+ resource "google_logging_organization_sink" "sink" {
      + destination      = (known after apply)
      + id               = (known after apply)
      + include_children = true
      + name             = "sk-c-logging-bkt"
      + org_id           = "172403920164"
      + writer_identity  = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.org_cloudsql_external_ip_access.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/sql.restrictPublicIp"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_compute_disable_guest_attributes_access.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.disableGuestAttributesAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_disable_nested_virtualization.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.disableNestedVirtualization"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_disable_sa_key_creation.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/iam.disableServiceAccountKeyCreation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_disable_serial_port_access.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.disableSerialPortAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_enforce_bucket_level_access.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/storage.uniformBucketLevelAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_shared_vpc_lien_removal.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.restrictXpnProjectLienRemoval"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_skip_default_network.google_organization_policy.org_policy_boolean[0] will be created
+ resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.skipDefaultNetworkCreation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.org_vm_external_ip_access.google_organization_policy.org_policy_list_deny_all[0] will be created
+ resource "google_organization_policy" "org_policy_list_deny_all" {
      + constraint  = "constraints/compute.vmExternalIpAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + deny {
              + all = true
            }
        }
    }

  # module.pubsub_destination.google_project_service.enable_destination_api will be created
+ resource "google_project_service" "enable_destination_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "pubsub.googleapis.com"
    }

  # module.pubsub_destination.google_pubsub_subscription.pubsub_subscription[0] will be created
+ resource "google_pubsub_subscription" "pubsub_subscription" {
      + ack_deadline_seconds       = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = (known after apply)
      + path                       = (known after apply)
      + project                    = (known after apply)
      + topic                      = (known after apply)

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.pubsub_destination.google_pubsub_topic.topic will be created
+ resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = (known after apply)
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }
    }

  # module.pubsub_destination.google_pubsub_topic_iam_member.pubsub_sink_member will be created
+ resource "google_pubsub_topic_iam_member" "pubsub_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.pubsub_destination.google_pubsub_topic_iam_member.pubsub_subscriber_role[0] will be created
+ resource "google_pubsub_topic_iam_member" "pubsub_subscriber_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.subscriber"
      + topic   = (known after apply)
    }

  # module.pubsub_destination.google_pubsub_topic_iam_member.pubsub_viewer_role[0] will be created
+ resource "google_pubsub_topic_iam_member" "pubsub_viewer_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.viewer"
      + topic   = (known after apply)
    }

  # module.pubsub_destination.google_service_account.pubsub_subscriber[0] will be created
+ resource "google_service_account" "pubsub_subscriber" {
      + account_id   = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.scc_notification.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.scc_notification.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.storage_destination.google_project_service.enable_destination_api will be created
+ resource "google_project_service" "enable_destination_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "storage-component.googleapis.com"
    }

  # module.storage_destination.google_storage_bucket.bucket will be created
+ resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.storage_destination.google_storage_bucket_iam_member.storage_sink_member will be created
+ resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.dns_hub.module.budget.google_billing_budget.budget[0] will be created
+ resource "google_billing_budget" "budget" {
      + billing_account = "01A498-EAE05D-589783"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + units = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.75
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.9
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.95
        }
    }

  # module.dns_hub.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.dns_hub.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-dns-hub"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "prj-c-dns-hub"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.dns_hub.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "prj-c-dns-hub Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.dns_hub.module.project-factory.null_resource.preconditions will be created
+ resource "null_resource" "preconditions" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.dns_hub.module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.interconnect.module.budget.google_billing_budget.budget[0] will be created
+ resource "google_billing_budget" "budget" {
      + billing_account = "01A498-EAE05D-589783"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + units = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.75
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.9
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.95
        }
    }

  # module.interconnect.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.interconnect.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-interconnect"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "prj-c-interconnect"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.interconnect.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "prj-c-interconnect Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.interconnect.module.project-factory.null_resource.preconditions will be created
+ resource "null_resource" "preconditions" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.interconnect.module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_audit_logs.module.budget.google_billing_budget.budget[0] will be created
+ resource "google_billing_budget" "budget" {
      + billing_account = "01A498-EAE05D-589783"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + units = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.75
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.9
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.95
        }
    }

  # module.org_audit_logs.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-logging"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "prj-c-logging"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "prj-c-logging Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.null_resource.preconditions will be created
+ resource "null_resource" "preconditions" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_billing_logs.module.budget.google_billing_budget.budget[0] will be created
+ resource "google_billing_budget" "budget" {
      + billing_account = "01A498-EAE05D-589783"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + units = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.75
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.9
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.95
        }
    }

  # module.org_billing_logs.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-billing-logs"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "prj-c-billing-logs"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "prj-c-billing-logs Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.null_resource.preconditions will be created
+ resource "null_resource" "preconditions" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_domain_restricted_sharing.module.allowed-policy-member-domains.google_organization_policy.org_policy_list_allow_values[0] will be created
+ resource "google_organization_policy" "org_policy_list_allow_values" {
      + constraint  = "constraints/iam.allowedPolicyMemberDomains"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "172403920164"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "C04i5g5ee",
                ]
            }
        }
    }

  # module.org_secrets.module.budget.google_billing_budget.budget[0] will be created
+ resource "google_billing_budget" "budget" {
      + billing_account = "01A498-EAE05D-589783"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + units = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.75
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.9
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.95
        }
    }

  # module.org_secrets.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.org_secrets.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-secrets"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "prj-c-secrets"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.org_secrets.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "prj-c-secrets Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.org_secrets.module.project-factory.null_resource.preconditions will be created
+ resource "null_resource" "preconditions" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.org_secrets.module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.scc_notifications.module.budget.google_billing_budget.budget[0] will be created
+ resource "google_billing_budget" "budget" {
      + billing_account = "01A498-EAE05D-589783"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + units = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.75
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.9
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.95
        }
    }

  # module.scc_notifications.module.project-factory.data.null_data_source.default_service_account will be read during apply
  # (config refers to values not yet known)
 <= data "null_data_source" "default_service_account"  {
      + has_computed_default = (known after apply)
      + id                   = (known after apply)
      + inputs               = {
          + "email" = (known after apply)
        }
      + outputs              = (known after apply)
      + random               = (known after apply)
    }

  # module.scc_notifications.module.project-factory.google_project.main will be created
+ resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01A498-EAE05D-589783"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-scc"
          + "billing_code"      = "1234"
          + "business_code"     = "abcd"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
        }
      + name                = "prj-c-scc"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.scc_notifications.module.project-factory.google_service_account.default_service_account will be created
+ resource "google_service_account" "default_service_account" {
      + account_id   = "project-service-account"
      + display_name = "prj-c-scc Project Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.scc_notifications.module.project-factory.null_resource.preconditions will be created
+ resource "null_resource" "preconditions" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.scc_notifications.module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.dns_hub.module.project-factory.module.gcloud_delete.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.dns_hub.module.project-factory.module.gcloud_deprivilege.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.dns_hub.module.project-factory.module.gcloud_deprivilege.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.dns_hub.module.project-factory.module.gcloud_disable.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["dns.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "dns.googleapis.com"
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.dns_hub.module.project-factory.module.project_services.google_project_service.project_services["servicenetworking.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.interconnect.module.project-factory.module.gcloud_delete.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.interconnect.module.project-factory.module.gcloud_deprivilege.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.interconnect.module.project-factory.module.gcloud_deprivilege.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.interconnect.module.project-factory.module.gcloud_disable.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.interconnect.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.interconnect.module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.interconnect.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.org_audit_logs.module.project-factory.module.gcloud_delete.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.module.gcloud_deprivilege.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.module.gcloud_deprivilege.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.module.gcloud_disable.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.module.project_services.google_project_service.project_services["bigquery.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "bigquery.googleapis.com"
    }

  # module.org_audit_logs.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.org_audit_logs.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.org_audit_logs.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.org_billing_logs.module.project-factory.module.gcloud_delete.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.module.gcloud_deprivilege.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.module.gcloud_deprivilege.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.module.gcloud_disable.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_billing_logs.module.project-factory.module.project_services.google_project_service.project_services["bigquery.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "bigquery.googleapis.com"
    }

  # module.org_billing_logs.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.org_billing_logs.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.org_billing_logs.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.org_secrets.module.project-factory.module.gcloud_delete.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_secrets.module.project-factory.module.gcloud_deprivilege.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.org_secrets.module.project-factory.module.gcloud_deprivilege.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_secrets.module.project-factory.module.gcloud_disable.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_secrets.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.org_secrets.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.org_secrets.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.org_secrets.module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "secretmanager.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.gcloud_delete.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.scc_notifications.module.project-factory.module.gcloud_deprivilege.null_resource.run_command[0] will be created
+ resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.scc_notifications.module.project-factory.module.gcloud_deprivilege.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.scc_notifications.module.project-factory.module.gcloud_disable.random_id.cache will be created
+ resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["iamcredentials.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
+ resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.scc_notifications.module.project-factory.module.project_services.google_project_service.project_services["pubsub.googleapis.com"] will be created

```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.